Revit 2024 API
LightType.ColorFilter Property
 The light filter color.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public Color ColorFilter { get; set; }
Visual Basic
Public Property ColorFilter As Color
	Get
	Set
Visual C++
public:
property Color^ ColorFilter {
	Color^ get ();
	void set (Color^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
LightType Class
Autodesk.Revit.DB.Lighting Namespace